Repository: 84000/data-translation-memory
Catalog: toh145-v4.tmx
Source language: bo
Languages: en

source: །ཆོས་རྣམ་སྦྱོང་བའི་འོད་ཟེར་རབ་གཏོང་ཞིང་། །འཇིག་རྟེན་ཕན་མཛད་རྒྱལ་བ་ཐམས་ཅད་ཀྱི། །སྤུ་རྣམས་ཀུན་ནས་ཆོས་རྣམས་བསམ་མི་ཁྱབ། །བྱུང་བ་ཐོས་ནས་མོས་པ་ཐམས་ཅད་ཚིམ།
en: “ ‘They emanate light rays that purify phenomena, And thus satisfy all the aspirations that have come from hearing The inconceivable teachings that have issued From all the hairs of all the victors who work for the benefit of the world.”

source: །རྐྱེན་ལས་བྱུང་བ་མ་སྐྱེས་ངོ་བོ་ཉིད།
en: “ ‘Their nature has not arisen through conditions.

source: །རྒྱལ་བ་རྣམས་ཀྱི་སྐུ་ནི་ཆོས་སྐུ་སྟེ། །ཆོས་ཉིད་མཁའ་བཞིན་རྟག་ཏུ་གནས་སོ་ཞེས། །བརྗོད་པས་ཆོས་རྣམས་སྦྱོང་བ་ཐོབ་པར་འགྱུར།
en: By teaching, “The body of the victors is the dharmakāya And its ultimate nature always abides like space,” They will achieve the purification of phenomena.

source: །འོད་ཟེར་སྒོ་མོ་དེ་དག་ལ་སོགས་པ།
en: “ ‘Such and other avenues of light rays,

source: །དྲང་སྲོང་རྣམས་ཀྱི་སྤུ་ཡི་སྒོ་གཅིག་ནས། །འོད་ཟེར་གང་གཱའི་བྱེ་མ་སྙེད་འབྱུང་སྟེ།
en: Numbering as many as the grains of sand of the river Ganges, Will appear from a single hair pore of the seers,

source: །ཀུན་ཀྱང་ལས་སྦྱོར་ཐ་དད་ཚུལ་ཅན་ནོ།
en: And each will have its specific karmic connection.

source: །ཇི་ལྟར་དེ་དག་སྤུ་ཡི་སྒོ་གཅིག་ནས།
en: “ ‘Just as they appear from a single pore,

source: །འོད་ཟེར་གང་གཱའི་བྱེ་མ་སྙེད་འབྱུང་བ།
en: So light rays numbering as many as the sands of the Ganges

source: །མ་ལུས་སྤུ་རྣམས་ཀུན་ནས་དེ་བཞིན་ཏེ།
en: Will shine from every pore without exception.

source: །དྲང་སྲོང་ཏིང་འཛིན་རྣམ་འཕྲུལ་འདི་འདྲའོ།
en: Such is the magical display of the absorption of the seer.

source: །ཡོན་ཏན་གང་གིས་འོད་ཟེར་གང་གྲུབ་པའི།
en: “ ‘By whichever qualities any light rays are achieved,

source: །ཡོན་ཏན་དེ་གྲོགས་སྔོན་ཆད་གང་གྱུར་པ།
en: Those are qualities with which one was formerly associated.

source: །དེ་དག་ཉིད་ལས་འོད་ཟེར་རབ་འབྱུང་སྟེ།
en: Thus, it is from these qualities that the light rays manifest.

source: །དྲང་སྲོང་ཡེ་ཤེས་རྣམ་འཕྲུལ་འདི་འདྲའོ།
en: Such is the magical display of the gnosis of the seer.

source: །དེ་དག་བསོད་ནམས་སྔོན་གྲོགས་གང་ཡིན་ལ། །རྗེས་སུ་ཡི་རང་གསོལ་བ་སུས་བཏབ་དང་། །གང་གིས་མཐོང་སྟེ་དགེ་བ་བསགས་གྱུར་པ། །དེ་དག་ཀུན་གྱིས་འོད་ཟེར་དེ་དག་ཤེས།
en: “ ‘Thus, those who were previously associated with merit And whoever subsequently offered their supplications And whoever thus beheld the light rays and accumulated merit—It is they who will know such light rays.

source: །གང་དག་བསོད་ནམས་བྱས་ཤིང་དགེ་བསགས་དང་།
en: “ ‘Whoever performed meritorious acts and gathered virtue,

source: །གང་དག་ཡང་ཡང་སངས་རྒྱས་རྣམས་མཆོད་ཅིང་།
en: And whoever worshiped the buddhas

source: །སངས་རྒྱས་ཡོན་ཏན་འདུན་ཏེ་དོན་གཉེར་བ།
en: And longed and strove for the qualities of buddhahood—

source: །དེ་དག་ཀུན་ལ་འོད་ཟེར་དེ་དག་བསྐུལ།
en: All were urged and inspired by the light rays.

source: །དཔེར་ན་དམུས་ལོང་ཉི་མ་མི་མཐོང་ཡང་།
en: “ ‘For example, even though a blind person cannot see the sun,

source: །དེ་མེད་མ་ཡིན་འཇིག་རྟེན་དག་ཏུ་འཆར།
en: It is not the case that it does not exist; it arises for people in the world.

source: །མིག་དང་ལྡན་པས་ཤར་བར་ཤེས་གྱུར་ནས།
en: Those possessing eyes, when they know that the sun is rising,

source: །ཀུན་ཀྱང་རང་རང་སོ་སོའི་ལས་ལ་འཇུག
en: All engage in their own respective kinds of work.

source: །དེ་བཞིན་སྐྱེས་ཆེན་འོད་ཟེར་དེ་དག་ཀུན།
en: “ ‘Just so, even though those light rays of sublime beings

source: །རབ་ཏུ་འབྱུང་ཡང་ལོག་པས་ཉེན་གྱུར་ཅིང་། །མོས་ཉམས་ཕལ་པ་རྣམས་ཀྱིས་མི་མཐོང་སྟེ།
en: Have certainly come into being, they are not seen by those afflicted by error Or by ordinary people of poor devotion.

source: །བློ་གྲོས་ཡངས་པ་རྣམས་ལ་དེ་དག་མོད།
en: Yet they may indeed be seen by those of vast intelligence.

source: །དཔེར་རྒྱན་ནོར་བུ་བཞོན་པ་གཞལ་མེད་ཁང་། །བཅུད་ཀྱིས་ལེན་དང་རིན་ཆེན་བྱུག་པ་སྤོས། །དེ་དག་སྐྱེ་བོ་ཆེ་ལ་ཡོད་མོད་ཀྱི།
en: “ ‘For example, rich people do indeed possess Such things as ornaments, jewels, vehicles, palaces, Elixirs, unguent oils, and fragrances,

source: །ཕོངས་པར་གྱུར་པ་རྣམས་ལ་དེ་དག་མེད།
en: Yet the poor lack such things.

source: །དེ་བཞིན་སྐྱེས་ཆེན་འོད་ཟེར་དེ་དག་མོད།
en: “ ‘Just so, the light rays of sublime beings certainly exist,

source: །དེ་དག་ཡོད་ཀྱང་ལོག་པས་ཉེན་གྱུར་ཅིང་།
en: Yet though they do exist, they are not seen by those afflicted by error

source: །མོས་པ་ཉམས་པ་རྣམས་ཀྱིས་མི་མཐོང་སྟེ།
en: Or by people of poor devotion.

source: །གང་དག་འོད་ཟེར་དབྱེ་བ་འདི་ཐོས་ནས།
en: “ ‘Those who, after hearing this discrimination of light rays,

source: །དད་ཅིང་མོས་ལ་དང་བ་སྐྱེས་གྱུར་ན། །བདག་ནི་ཡོན་ཏན་ཆེར་འགྱུར་མི་འགྱུར་ཞེས། །དེ་དག་དོགས་དང་སོམ་ཉི་མི་སྐྱེད་དོ།
en: Feel faith, devotion, and appreciation, Should not doubt or question Whether they will consequently develop great qualities or not. “ ‘They realize through an excellent absorption

source: །དེ་དག་གཡོག་འཁོར་བཀོད་པ་རྣམ་འཕྲུལ་བ།
en: The magical array of a circle of servants

source: །ཕྱོགས་བཅུ་ཀུན་དུ་དོ་ཟླ་མེད་རྣམས་ཀྱི།
en: And project in all ten directions

source: །ཞམ་རིང་སངས་རྒྱས་སྲས་རྣམས་སྟོན་པར་བྱེད།
en: Peerless personal attendants, bodhisattvas.

source: །འོད་བཀོད་དེ་དག་པད་མ་སྣ་ཚོགས་པ།
en: “ ‘Having magically caused the light arrays with various lotuses

source: །སྟོང་གསུམ་ཚད་ཙམ་བྱིན་གྱིས་བརླབས་བྱས་ནས།
en: To become the size of the billionfold universe,

source: །སྐྱིལ་ཀྲུང་བཅས་པའི་ལུས་ཀྱིས་ཀུན་ཁྱབ་སྟོན།
en: They project bodies in seated postures, pervading everywhere;

source: །ཏིང་འཛིན་རྣམ་པར་འཕྲུལ་པ་འདི་འདྲའོ།
en: Such is the magical display of meditative absorptions.

source: །དེ་དག་ཞིང་བཅུའི་རྡུལ་སྙེད་པད་མ་གཞན། །འཁོར་དང་བཅས་པ་བྱིན་གྱིས་བརླབས་བྱས་ཤིང་།
en: “ ‘Having blessed the other lotuses Numbering as many as the atoms of ten buddhafields, Together with the retinues,

source: །སངས་རྒྱས་སྲས་ཀྱིས་ཐམས་ཅད་ཡོངས་སུ་བསྐོར།
en: They will be completely surrounded by all the sons of buddhas.

source: །དེ་དག་ཏིང་འཛིན་ཏིང་འཛིན་མེད་པར་གནས།
en: They repose either in absorption or not in absorption.

source: །དྲང་སྲོང་དེ་ཡིས་སེམས་ཅན་གང་དག་རྣམས།
en: “ ‘Those seers have matured and transformed those beings,

source: །ཡོངས་སུ་སྨིན་བྱས་སངས་རྒྱས་ལེགས་བསྒྲུབས་པ།
en: Having accomplished excellent buddhahood.

source: །དེ་དག་པད་མ་ཆེན་པོ་དེ་བསྐོར་ཅིང་།
en: Those beings surround the great lotus.

source: །ཀུན་ཀྱང་ཐལ་མོ་སྦྱར་ནས་ལྟ་ཞིང་འཁོད།
en: All of them repose there, seated with folded hands, looking ahead.

source: །གང་དག་ཏིང་འཛིན་གནས་པར་རབ་ཞུགས་པ།
en: “ ‘Those that remain in absorption

source: །སྐྱེས་ཆེན་རྣམས་ཀྱི་ཆོས་ཉིད་འདི་ཡིན་ཏེ།
en: Represent the ultimate nature of sublime beings,

source: །རང་གི་སློབ་མས་ཀུན་ཀྱང་ཡོངས་བསྐོར་ནས།
en: Having been surrounded by their own disciples

source: །སྐར་མའི་ཚོགས་ཀྱིས་ཟླ་བ་བསྐོར་བ་བཞིན།
en: Like the moon surrounded by a constellation of stars.

source: །དེ་དག་ཇི་ལྟར་ཕྱོགས་གཅིག་རབ་འཇུག་ཅིང་།
en: “ ‘Just as they operate in one direction

source: །ཞབས་འབྲིང་སངས་རྒྱས་སྲས་རྣམས་སྟོན་བྱེད་པ།
en: And have projected their servants, the bodhisattvas,

source: །དེ་བཞིན་ཕྱོགས་རྣམས་མ་ལུས་ཀུན་དུ་སྟོན།
en: So they project in every direction;

source: །དེ་དག་ཕྱོགས་ཀྱི་དྲ་བ་ཁྱབ་གནས་པའི། །ཏིང་འཛིན་དམ་པ་མངོན་པར་སྒྲུབ་བྱེད་ཅིང་།
en: “ ‘Having actualized the ultimate absorption That prevails as a net pervading every direction,

source: །ཁ་ཅིག་མཉམ་གཞག་ཁ་ཅིག་ལྡང་བར་ཡང་། །ཕྱོགས་བཅུ་ཀུན་དུ་རང་གི་ལུས་སྟོན་ཏོ།
en: They project in all ten directions their own bodies, Some in equipoise and some rising up.

source: །དེ་དག་ཤར་གྱི་ཕྱོགས་སུ་མཉམ་བཞག་ཅིང་།
en: “ ‘In the eastern direction they rest in meditative equipoise,

source: །ནུབ་ཀྱི་ཕྱོགས་ནས་དཔའ་བོ་རྣམ་པར་ལྡང་།
en: While in the western direction the hero rises up.

source: །ནུབ་ཀྱི་ཕྱོགས་སུ་མཉམ་བར་བཞག་གྱུར་ཅིང་།
en: When in the west, they rest in equipoise,

source: །བདག་ཉིད་ཆེན་པོ་ཤར་གྱི་ཕྱོགས་ནས་ལྡང་།
en: In the east the great being rises up.

source: །དེ་བཞིན་ཕྱོགས་བཅུ་རྣམས་སུ་རབ་ཏུ་འཇུག
en: “ ‘They operate in this manner in the ten directions.

source: །གཞན་གྱི་ཕྱོགས་སུ་མཉམ་བར་བཞག་གྱུར་ལ།
en: While they rest in equipoise in the other directions,

source: །ཡེ་ཤེས་ཡོན་ཏན་ཕྱུག་པོ་གཞན་ནས་ལྡང་།
en: Those in opposite directions rise up, rich with the quality of gnosis.

source: །ཤར་ཕྱོགས་སངས་རྒྱས་ཞིང་རྣམས་གང་ཡིན་པ། །གྲངས་མེད་མ་ལུས་དག་ན་རང་བྱུང་བ།
en: “ ‘In all those innumerable buddhafields That are in the eastern direction, self-arisen,

source: །དེ་དག་སྤྱན་སྔར་ཞབས་དྲུང་དེ་དག་རྣམས།
en: Those beings who are in their presence, at their feet,

source: །ཞི་བའི་ཏིང་ངེ་འཛིན་ལ་གནས་པར་སྣང་།
en: Appear as dwelling in peaceful absorptions.

source: །ཕྱོགས་དེར་མཉམ་པར་བཞག་པར་བསྟན་བྱས་ནས།
en: “ ‘Having displayed resting in equipoise in that direction,

source: །དཔའ་བོ་ནུབ་ཀྱི་ཞིང་རྣམས་མ་ལུས་པར།
en: The hero in all the western buddhafields rises up

source: །རྣམ་པར་ལྡང་ཞིང་མངོན་སུམ་རྒྱལ་ཀུན་ལ། །མཆོད་པ་དུ་མ་རབ་ཏུ་བྱེད་པར་སྣང་།
en: And it appears that much worship is offered In front of all the victors.

source: །ནུབ་ཕྱོགས་སངས་རྒྱས་ཞིང་རྣམས་གང་ཡིན་པ།
en: “ ‘Then it appears that in all the buddhafields in the west

source: །གྲངས་མེད་མ་ལུས་དག་ན་བཞུགས་སངས་རྒྱས།
en: Without exception, alongside those seated buddhas,

source: །དཔའ་བོ་ཤར་གྱི་ཞིང་རྣམས་མ་ལུས་པར། །རྣམ་པར་ལྡང་ཞིང་མངོན་སུམ་རྒྱལ་ཀུན་ལ།
en: It appears that the hero in all the eastern buddhafields rises up,

source: །མཆོད་པ་དུ་མ་རབ་ཏུ་བྱེད་པར་སྣང་།
en: And it appears that much worship is offered In front of all the victors

source: །དེ་བཞིན་ཕྱོགས་བཅུ་དག་གི་ཞིང་རྣམས་སུ།
en: “ ‘Likewise, in the buddhafields in all directions

source: །ཕྱོགས་རྣམས་མ་ལུས་ཀུན་དུ་བརྟན་པ་འཇུག །ཁ་ཅིག་མཉམ་གཞག་ཁ་ཅིག་ལངས་གྱུར་ཅིང་།
en: Stability ensues in every direction without exception, With some resting in equipoise and some rising up.

source: །འཇིག་རྟེན་སྒྲོན་མ་རྣམས་ལ་མཆོད་བྱེད་སྣང་།
en: And it appears the lamps of the world are being worshipped.

source: །དེ་དག་མིག་གི་ལམ་ལ་མཉམ་བཞག་ཅིང་།
en: “ ‘They rest in equipoise in the path of the eyes,

source: །གཟུགས་ཀྱི་ལམ་ནས་བདག་ཉིད་ཆེན་པོ་ལྡང་།
en: While the great being rises through the path of form.

source: །གཟུགས་རྣམས་བསམ་གྱིས་མི་ཁྱབ་སྟོན་པ་ན།
en: When those inconceivable forms are displayed,

source: །དེ་ལ་ལྷར་བཅས་འཇིག་རྟེན་རྨོངས་པར་འགྱུར།
en: The world with its gods grows befuddled.

source: །གཟུགས་ཀྱི་ལམ་ལ་མཉམ་པར་བཞག་གྱུར་ལ།
en: “ ‘ They rest in equipoise in the path of form

source: །མིག་ནི་མ་སྐྱེས་མ་བྱུང་རང་བཞིན་ཏེ། །སྟོང་པ་བྱེད་པ་མེད་པར་རབ་སྟོན་ཅིང་།
en: And demonstrate that the eye has the nature of being unborn and unarisen And is empty and without any doer,

source: །མིག་གི་ལམ་ནས་དྲན་ལྡན་རྣམ་པར་ལྡང་།
en: While the mindful one rises up from the path of the eyes.

source: །དེ་དག་རྣ་བའི་ལམ་ལ་མཉམ་བཞག་ཅིང་།
en: “ ‘ They rest in equipoise in the path of the ears,

source: །སྒྲ་ཡི་ལམ་ནས་བདག་ཉིད་ཆེན་པོ་ལྡང་།
en: While the great being rises through the path of sound.

source: །གང་ལ་ལྷར་བཅས་འཇིག་རྟེན་རྨོངས་འགྱུར་བ།
en: In a way that makes the world with its gods grow befuddled,

source: །སྒྲ་དང་སྐད་རྣམས་ཀུན་ལ་རབ་ཏུ་ཞུགས།
en: He makes his appearance in all sounds and languages.

source: །སྒྲ་ཡི་ལམ་ལ་མཉམ་པར་བཞག་གྱུར་ཅིང་།
en: “ ‘They rest in equipoise in the path of sound

source: །རྣ་བ་མ་སྐྱེས་མ་བྱུང་རང་བཞིན་ཏེ། །སྟོང་པ་བྱེད་པ་མེད་པར་རབ་སྟོན་ཅིང་།
en: And demonstrate that the ear has the nature of being unborn and unarisen And is empty and without any doer,

source: །རྣ་བའི་ལམ་ནས་དྲན་ལྡན་རྣམ་པར་ལྡང་།
en: While the mindful one rises up from the path of the ears.

source: །དེ་དག་སྣ་ཡི་ལམ་ལ་མཉམ་བཞག་ཅིང་།
en: “ ‘They rest in equipoise in the path of the nose,

source: །དྲི་ཡི་ལམ་ནས་བདག་ཉིད་ཆེན་པོ་ལྡང་།
en: While the great being rises through the path of smells.

source: །གང་དུ་ལྷར་བཅས་འཇིག་རྟེན་རྨོངས་འགྱུར་བ།
en: In a way that makes the world with its gods grow befuddled,

source: །དྲི་མཆོག་དམ་པ་འཇུག་པར་རབ་ཏུ་ཞུགས།
en: He makes his appearance as the best of smells.

source: །དྲི་ཡི་ལམ་ལ་མཉམ་པར་བཞག་གྱུར་ཅིང་།
en: “ ‘They rest in equipoise in the path of smells

source: །སྣ་ནི་མ་སྐྱེས་མ་བྱུང་རང་བཞིན་ཏེ། །སྟོང་པ་བྱེད་པ་མེད་པ་རབ་སྟོན་ཅིང་།
en: And demonstrate that the nose has the nature of being unborn and unarisen And is empty and without any doer,

source: །སྣ་ཡི་ལམ་ནས་དྲན་ལྡན་རྣམ་པར་ལྡང་།
en: While the mindful one rises through the path of the nose.

source: །དེ་དག་ལྕེ་ཡི་ལམ་ལ་མཉམ་བཞག་ཅིང་།
en: “ ‘They rest in equipoise in the path of the tongue,

source: །རོ་མཆོག་ཀུན་གྱི་ལམ་ནས་རྣམ་པར་ལྡང་།
en: While the great being rises through the path of all the best tastes.

source: །བདག་ཉིད་ཆེན་པོ་རོ་མཆོག་རྣམས་དང་ལྡན།
en: The great being possesses the supreme tastes.

source: །རོ་མཆོག་རྣམས་ལ་མཉམ་པར་བཞག་གྱུར་ཅིང་།
en: “ ‘They rest in equipoise in these supreme tastes

source: །ལྕེ་ནི་མ་སྐྱེས་མ་བྱུང་རང་བཞིན་ཏེ། །སྟོང་པ་བྱེད་པ་མེད་པར་རབ་སྟོན་ཅིང་།
en: And demonstrate that the tongue has the nature of being unborn and unarisen And is empty and without any doer,

source: །ལྕེ་ཡི་ལམ་ནས་དྲན་ལྡན་རྣམ་པར་ལྡང་།
en: While the mindful one rises through the path of the tongue.

source: །དེ་དག་ལུས་ཀྱི་ལམ་ལ་མཉམ་བཞག་ཅིང་།
en: “ ‘They rest in equipoise in the path of the body,

source: །རེག་པའི་ལམ་ནས་བདག་ཉིད་ཆེན་པོ་ལྡང་།
en: While the great being rises through the path of touch.

source: །འཇིག་རྟེན་བདེ་བ་སྐྱེད་པའི་རེག་ལ་ཞུགས།
en: He makes his appearance as all sensations that cause pleasure in the world.

source: །རེག་པའི་ལམ་ལ་མཉམ་པར་བཞག་གྱུར་ཅིང་།
en: “ ‘They rest in equipoise in the path of touch

source: །ལུས་ནི་མ་སྐྱེས་མ་བྱུང་རང་བཞིན་ཏེ། །སྟོང་པ་བྱེད་པ་མེད་པར་རབ་སྟོན་ཅིང་།
en: And demonstrate that the body has the nature of being unborn and unarisen And is empty and without any doer,

source: །ལུས་ཀྱི་ལམ་ནས་དྲན་ལྡན་རྣམ་པར་ལྡང་།
en: While the mindful one rises through the path of the body.

source: །དེ་དག་སེམས་ཀྱི་ལམ་ལ་མཉམ་བཞག་ཅིང་།
en: “ ‘They rest in equipoise in the path of mind.

source: །ཆོས་ཀྱི་ལམ་ནས་བདག་ཉིད་ཆེན་པོ་ལྡང་།
en: While the great being rises through the path of phenomena.

source: །ཆོས་ལ་གནས་པའི་འཇུག་པ་རབ་ཏུ་ཞུགས།
en: He makes his appearance abiding in phenomena.

source: །ཆོས་ལམ་རྣམས་ལ་མཉམ་པར་བཞག་གྱུར་ཅིང་།
en: “ ‘They rest in equipoise in the path of phenomena

source: །སེམས་ནི་མ་སྐྱེས་མ་བྱུང་རང་བཞིན་ཏེ། །སྟོང་པ་བྱེད་པ་མེད་པར་རབ་སྟོན་ཅིང་།
en: And demonstrate that the mind has the nature of being unborn and unarisen And is empty and without any doer,

source: །སེམས་ཀྱི་ལམ་ནས་དྲན་ལྡན་རྣམ་པར་ལྡང་།
en: While the mindful one rises through the path of mind.

source: །དེ་དག་བྱིས་པའི་ལུས་ལ་མཉམ་བཞག་ཅིང་།
en: “ ‘They rest in equipoise within the bodies of infants,

source: །ལང་ཚོ་ཤུགས་ལ་གནས་པ་རྣམས་ལས་ལྡང་།
en: While he rises through those living in the vigor of youth.

source: །ལང་ཚོ་ཤུགས་གནས་རྣམས་ལ་མཉམ་བཞག་ཅིང་།
en: They rest in equipoise in the vigor of youth,

source: །རྒས་ཤིང་འཁོགས་པའི་ལུས་ལས་རྣམ་པར་ལྡང་།
en: While he rises through bodies old and decrepit.

source: །རྒས་ཤིང་འཁོགས་པའི་ལུས་ལ་མཉམ་བཞག་ཅིང་།
en: “ ‘They rest in equipoise within bodies old and decrepit,

source: །དད་པའི་དགེ་བསྙེན་མ་ཡི་ལུས་ལས་ལྡང་།
en: While he rises through the bodies of faithful female lay followers.

source: །དགེ་བསྙེན་དད་མའི་ལུས་ལ་མཉམ་བཞག་ཅིང་།
en: They rest in equipoise within the bodies of faithful female lay followers,

source: །དད་པའི་དགེ་བསྙེན་ལུས་ལས་རྣམ་པར་ལྡང་།
en: While he rises through the bodies of faithful laymen.

source: །དད་པའི་དགེ་བསྙེན་ལུས་ལ་མཉམ་བཞག་ཅིང་།
en: “ ‘They rest in equipoise within the bodies of faithful laymen,

source: །དགེ་སློང་མ་ཡི་ལུས་ལས་རྣམ་པར་ལྡང་།
en: While he rises through the bodies of fully ordained nuns.

source: །དགེ་སློང་མ་ཡི་ལུས་ལ་མཉམ་བཞག་ཅིང་།
en: They rest in equipoise within the bodies of fully ordained nuns,

source: །དགེ་སློང་མང་དུ་ཐོས་པའི་ལུས་ལས་ལྡང་།
en: While he rises through the bodies of learned fully ordained monks.

source: །དགེ་སློང་མང་ཐོས་ལུས་ལ་མཉམ་བཞག་ཅིང་།
en: “ ‘They rest in equipoise within the bodies of learned fully ordained monks,

source: །སློབ་དངམི་སློབ་ལུས་ལས་རྣམ་པར་ལྡང་།
en: While he rises through the bodies of trainees and non-trainees.

source: །སློབ་དང་མི་སློབ་ལུས་ལ་མཉམ་བཞག་ཅིང་།
en: They rest in equipoise within the bodies of trainees and non-trainees,

source: །རྐྱེན་གྱི་སངས་རྒྱས་ལུས་ལས་རྣམ་པར་ལྡང་།
en: While he rises through the bodies of buddhas of conditions.

source: །རྐྱེན་གྱི་སངས་རྒྱས་ལུས་ལ་མཉམ་བཞག་ཅིང་།
en: “ ‘They rest in equipoise within the bodies of buddhas of conditions,

source: །སངས་རྒྱས་སྐུ་མཆོག་རབ་ལས་རྣམ་པར་ལྡང་།
en: While he rises through the supreme embodiments of buddhas.

source: །སངས་རྒྱས་སྐུ་མཆོག་རབ་ལ་མཉམ་བཞག་ཅིང་།
en: They rest in equipoise within the supreme embodiments of buddhas,

source: །ལྷ་ཡི་ལུས་གཟུགས་ལས་ནི་རྣམ་པར་ལྡང་།
en: While he rises through the form bodies of gods.

source: །ལྷ་ཡི་ལུས་གཟུགས་ལ་ནི་མཉམ་བཞག་ཅིང་།
en: “ ‘They rest in equipoise within the bodies of gods,

source: །རྫུ་འཕྲུལ་ཆེན་པོ་ཀླུ་ཡི་ལུས་ལས་ལྡང་།
en: While he rises through the bodies of great-magical-wonder nāgas.

source: །རྫུ་འཕྲུལ་ཀླུ་ཡི་ལུས་ལ་མཉམ་བཞག་ཅིང་།
en: They rest in equipoise within the bodies of great-magical-wonder nāgas,

source: །འཕྲུལ་ཆེན་གནོད་སྦྱིན་ལུས་ལས་རྣམ་པར་ལྡང་།
en: While he rises through the bodies of great-magical-wonder yakṣas.

source: །འཕྲུལ་ཆེན་གནོད་སྦྱིན་ལུས་ལ་མཉམ་བཞག་ཅིང་།
en: “ ‘They rest in equipoise within the bodies of great-magical-wonder yakṣas,

source: །འབྱུང་པོ་ཀུན་གྱི་ལུས་ལས་རྣམ་པར་ལྡང་།
en: While he rises through the bodies of all bhūta evil spirits.

source: །འབྱུང་པོ་ཀུན་གྱི་ལུས་ལ་མཉམ་བཞག་ཅིང་།
en: They rest in equipoise within the bodies of all bhūta evil spirits,

source: །སྤུ་ཡི་སྒོ་གཅིག་ནས་ནི་རྣམ་པར་ལྡང་།
en: While he rises through single hair pores.

source: །སྤུ་སྒོ་གཅིག་ལ་མཉམ་པར་བཞག་གྱུར་ཅིང་།
en: “ ‘They rest in equipoise within single hair pores,

source: །སྤུ་སྒོ་ཐམས་ཅད་ནས་ནི་རྣམ་པར་ལྡང་།
en: While he rises through the totality of all existing hair pores.

source: །སྤུ་སྒོ་ཀུན་ལ་མཉམ་པར་བཞག་གྱུར་ཅིང་།
en: They rest in equipoise within the totality of all existing hair pores,

source: །སྐྲ་རྩེ་གཅིག་གི་ཁྱོན་ལས་རྣམ་པར་ལྡང་།
en: While he rises through the length of a single hair tip.

source: །སྐྲ་རྩེ་གཅིག་གི་ཁྱོན་ལ་མཉམ་བཞག་ཅིང་།
en: “ ‘They rest in equipoise within the length of a single hair tip,

source: །སྐྲ་རྩེ་ཀུན་གྱི་ཁྱོན་ལས་རྣམ་པར་ལྡང་།
en: While he rises through the length of all hair tips.

source: །སྐྲ་རྩེ་ཀུན་གྱི་ཁྱོན་ལ་མཉམ་བཞག་ཅིང་།
en: They rest in equipoise within the length of all hair tips,

source: །ཕྲ་རབ་རྡུལ་གྱི་རྡུལ་ལས་དེ་དག་ལྡང་།
en: While he rises through single extremely subtle atoms.

source: །རྡུལ་གཅིག་ལ་ནི་མཉམ་བར་བཞག་གྱུར་ཅིང་།
en: “ ‘They rest in equipoise within single extremely subtle atoms,

source: །མ་ལུས་རྡུལ་རྣམས་ཀུན་ལས་རྣམ་པར་ལྡང་།
en: While he rises through the totality of all extremely fine particles.

source: །རྡུལ་རྣམས་མ་ལུས་ཀུན་ལ་མཉམ་བཞག་ཅིང་།
en: They rest in equipoise within the totality of all extremely fine particles,

source: །རྒྱ་མཚོའི་རྡོ་རྗེའི་གཞི་ལས་རྣམ་པར་ལྡང་།
en: While he rises through the vajra bed of the ocean.

source: །རྒྱ་མཚོའི་རྡོ་རྗེའི་གཞི་ལ་མཉམ་བཞག་ཅིང་།
en: “ ‘They rest in equipoise within the vajra bed of the ocean,

source: །ནོར་བུའི་ཤིང་ཏོག་དག་ལས་རྣམ་པར་ལྡང་།
en: While he rises through jewel fruits.

source: །ཤིང་ཏོག་རྣམས་ལ་མཉམ་པར་བཞག་གྱུར་ནས།
en: They rest in equipoise within jewel fruits,

source: །རྒྱལ་བ་རྣམས་ཀྱི་འོད་ཟེར་སྒོ་ནས་ལྡང་།
en: While he rises through the paths of the victors’ light rays.

source: །རྒྱལ་བའི་འོད་ཟེར་སྒོ་ལ་མཉམ་བཞག་ཅིང་།
en: “ ‘They rest in equipoise within the paths of the victors’ light rays,

source: །རྒྱ་མཚོའི་ཆུ་ཡི་ཆུ་ཀླུང་རྣམས་ལས་ལྡང་།
en: While he rises through the tributary rivers of the ocean.

source: །རྒྱ་མཚོའི་ཆུ་ཀླུང་རྣམས་ལ་མཉམ་བཞག་ཅིང་།
en: They rest in equipoise within the tributary rivers of the ocean,

source: །བདག་ཉིད་ཆེན་པོ་མེ་ཡི་ལམ་ནས་ལྡང་།
en: While the great being rises through the path of fire.

source: །མེ་ཡི་ལམ་ལ་མཉམ་པར་བཞག་གྱུར་ཅིང་།
en: “ ‘They rest in equipoise within the path of fire,

source: །རླུང་གི་ལམ་ལས་དྲན་ལྡན་རྣམ་པར་ལྡང་།
en: While the mindful one rises through the path of air.

source: །རླུང་གི་ལམ་ལ་མཉམ་པར་བཞག་གྱུར་ཅིང་།
en: They rest in equipoise within the path of air,

source: །བདག་ཉིད་ཆེན་བོ་ས་ཡི་གཞི་ལས་ལྡང་།
en: While the great being rises through the basis of earth.

source: །ས་ཡི་གཞི་ལ་མཉམ་པར་བཞག་གྱུར་ཅིང་།
en: “ ‘They rest in equipoise on the basis of earth,

source: །ལྷ་ཀུན་གཞལ་མེད་ཁང་ལས་རྣམ་པར་ལྡང་།
en: While he rises through the divine palaces of all gods.

source: །ལྷ་ཀུན་གཞལ་མེད་ཁང་ལ་མཉམ་བཞག་ཅིང་།
en: They rest in equipoise within the divine palaces of all gods,

source: །དྲན་ལྡན་དེ་དག་མཁའ་ལས་རྣམ་པར་ལྡང་།
en: While the mindful one rises through the sky.

source: །ཡོན་ཏན་བསམ་ཡས་བསགས་པ་དེ་དག་གི། །ཏིང་འཛིན་རྣམ་ཐར་དེ་དག་བསམ་མི་ཁྱབ།
en: “ ‘The absorptions and emancipations Of those inconceivable accumulated qualities are beyond thought.

source: །རྒྱལ་བ་ཀུན་གྱིས་བསྐལ་པ་བསམ་ཡས་སུ།
en: All victors, giving explanations for unimaginably many eons,

source: །བཤད་པ་མཛད་ཀྱང་ཟད་པར་མཛད་མི་སྤྱོད།
en: Would not be able to exhaust them.

source: །འགྲོ་ལས་རྣམ་སྨིན་བསམ་གྱིས་མི་ཁྱབ་སྟེ།
en: “ ‘Their maturing deeds for living beings are inconceivable,

source: །རྒྱལ་བ་ཀུན་གྱིས་དེ་དག་གསུངས་པ་ནི།
en: And what has been said of those by all the victors

source: །ཀླུ་ཡི་རྣམ་འཕྲུལ་སངས་རྒྱས་རྣམ་འཕྲུལ་དང་། །བསམ་བྱེད་བསམ་གཏན་རྣམ་འཕྲུལ་བསམ་མི་ཁྱབ།
en: Include the magical displays of nāgas, magical displays of buddhas, And the mentally created magical displays of meditative concentration.

source: །དེ་དག་ལ་ཡང་དཔེ་བསྟན་བརྗོད་པར་བྱ།
en: “ ‘These may be explained using examples.

source: །དེ་དག་འདྲ་བའི་དཔེ་ཟླ་ཅང་མེད་དེ།
en: Although there are no examples for these things that can compare,

source: །མཁས་ཤིང་རིག་པའི་སྐྱེ་བོ་དཔེ་རྣམས་ཀྱིས། །བསྟན་ན་མྱུར་དུ་དོན་རྣམས་ཤེས་པར་འགྱུར།
en: Skillful and knowledgeable people will quickly understand their true sense If they are taught by means of examples.

source: །རྣམ་ཐར་བརྒྱད་ཀྱི་དབང་ལ་གནས་པ་ཡི། །ཉན་ཐོས་གཅིག་ཏུ་གྱུར་ནས་མང་པོར་འགྱུར།
en: “ ‘He who became a single śrāvaka Dwelling in the power of the eight emancipations became many.

source: །མང་པོར་གྱུར་ནས་ཕྱིར་ཡང་གཅིག་གྱུར་ཏེ།
en: From the many he then transformed back into one.

source: །མཁའ་ལ་བསམ་གཏན་འཆའ་ཞིང་འབར་བར་བྱེད།
en: He remained in meditative concentration in the sky and then made himself blaze.

source: །སྨད་ནས་མེ་འབར་སྟོད་ནས་ཆུ་ཡི་རྒྱུན། །སྟོད་ནས་མེ་འབར་སྨད་ནས་ཆུ་ཡི་རྒྱུན། །འགྲོ་དང་འགྲེང་དང་ཉལ་དང་འདུག་པ་དང་། །ལུས་འཕྲུལ་སྐད་ཅིག་གཅིག་ལ་བསམ་མི་ཁྱབ།
en: “ ‘From his lower part blazed fire, while from his upper part streamed water. Then from his upper part blazed fire, while from his lower part streamed water. He displayed the inconceivable bodily wonder Of instantaneously walking, standing, lying down, and sitting.

source: །དེ་ནི་སྙིང་རྗེ་ཆེ་དང་མི་ལྡན་ཞིང་།
en: “ ‘Even those who have little compassion

source: །བྱང་ཆུབ་མི་ཚོལ་འཇིག་རྟེན་ཡལ་འདོར་ཡང་།
en: And do not seek awakening though they abandon the world—

source: །ལུས་ཀྱི་རྣམ་འཕྲུལ་བསམ་ཡས་སྟོན་བྱེད་ན།
en: When such inconceivable wonders of the body are displayed to them,

source: །འཇིག་རྟེན་ཕན་འདོད་ཅི་ཕྱིར་སྟོན་མི་བྱེད།
en: Why would they not evince the desire to benefit the beings of the world?

source: །ཉི་ཟླ་མཁའ་ལ་རྣམ་པར་རྒྱུ་འདོད་ཞིང་།།ཕྱོགས་རྣམས་ཀུན་གྱི་ཆུ་ཡི་དངོ་དག་དང་། །མཚོ་མཚེའུ་མཚོ་བྲན་སྣོང་དང་རིན་ཆེན་དང་། །རྒྱ་མཚོ་ཆུ་ཀླུང་རྣམས་སུ་གཟུགས་བརྙན་སྟོན། །
en: “ ‘The great being displays reflections such as The sun and moon passing through the sky, Shorelines of bodies of water in all directions, Lakes, ponds, tarns, containers, Jewels, oceans, and tributaries.

source: དེ་བཞིན་གཟུགས་རྣམས་བསམ་གྱིས་མི་ཁྱབ་པ། །སྐྱེས་བུ་དཔའ་བོ་ཕྱོགས་བཅུ་ཀུན་དུ་སྟོན།
en: “ ‘Likewise, he projects inconceivable bodies Of heroes in all ten directions.

source: །ཏིང་འཛིན་རྣམ་ཐར་ཀུན་གྱི་ཚུལ་ལ་མཁས།
en: Being expert in all the emancipations of absorptions,

source: །དེ་ལ་དེ་བཞིན་གཤེགས་པ་རང་བྱུང་དབང་།
en: He has the innate power of a tathāgata.

source: །དང་བའི་མཚོ་ལ་ཡན་ལག་བཞི་པའི་དམག །དེ་དག་སོ་སོར་རང་གི་གཟུགས་བརྙན་མཐོང་།
en: “ ‘In a clear lake he is seen in the reflections Of four-platoon armies in all their details.

source: །རལ་གྲི་མདའ་ཆེན་གཞུ་དང་མདའ་རྣམས་དང་། །གོ་གྱོན་བཞོན་དང་ཐེག་པར་བཅས་སུ་མཐོང་།
en: He is seen as swords, spears, bows, and arrows, Armor, horses, and chariots.
